program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3402.3.2"}, {"coremlc-version", "3402.4.1"}, {"coremltools-component-tensorflow", "2.12.0"}, {"coremltools-version", "7.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 43844, 1]> input_2) {
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_concat_7_axis = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_concat_7_axis"), val = tensor<int32, []>(1)];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_Pow_y = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Pow_y"), val = tensor<fp32, []>(0x1p+1)];
            tensor<int32, [3]> StatefulPartitionedCall_model_1_cq_t2010v2_1_transpose_70_perm = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_transpose_70_perm"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp32, []> StatefulPartitionedCall_model_1_normalized_log_1_add_y = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_normalized_log_1_add_y"), val = tensor<fp32, []>(0x1.b7cdfep-34)];
            tensor<int32, []> StatefulPartitionedCall_model_1_harmonic_stacking_concat_axis = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_harmonic_stacking_concat_axis"), val = tensor<int32, []>(-1)];
            tensor<fp32, [309, 1, 1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Sqrt = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Sqrt"), val = tensor<fp32, [309, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, []> StatefulPartitionedCall_model_1_normalized_log_1_truediv = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_normalized_log_1_truediv"), val = tensor<fp32, []>(0x1.15f2cep+2)];
            tensor<fp32, [1]> StatefulPartitionedCall_model_1_batch_normalization_ReadVariableOp = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_batch_normalization_ReadVariableOp"), val = tensor<fp32, [1]>([0x1.f3f4ccp-2])];
            tensor<fp32, [1]> StatefulPartitionedCall_model_1_batch_normalization_ReadVariableOp_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_batch_normalization_ReadVariableOp_1"), val = tensor<fp32, [1]>([0x1.7990b2p-2])];
            tensor<fp32, [1]> StatefulPartitionedCall_model_1_batch_normalization_FusedBatchNormV3_ReadVariableOp = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_batch_normalization_FusedBatchNormV3_ReadVariableOp"), val = tensor<fp32, [1]>([0x1.01161ep-1])];
            tensor<fp32, [1]> StatefulPartitionedCall_model_1_batch_normalization_FusedBatchNormV3_ReadVariableOp_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_batch_normalization_FusedBatchNormV3_ReadVariableOp_1"), val = tensor<fp32, [1]>([0x1.351f98p-5])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape_shape = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape_shape"), val = tensor<int32, [2]>([1, 43844])];
            tensor<fp32, [1, 43844]> StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape = reshape(shape = StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape_shape, x = input_2)[name = tensor<string, []>("StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape")];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes_axes_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 43844]> StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes = expand_dims(axes = StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes_axes_0, x = StatefulPartitionedCall_model_1_flatten_audio_ch_1_reshape_Reshape)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes")];
            tensor<fp32, []> const_0 = const()[name = tensor<string, []>("const_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_0_pad_0 = const()[name = tensor<string, []>("pad_0_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 44098]> pad_0 = pad(constant_val = const_0, mode = pad_0_mode_0, pad = pad_0_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes)[name = tensor<string, []>("pad_0")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_31 = const()[name = tensor<string, []>("const_31"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 44100]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad_mode_0, pad = const_31, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_strided_slice_new_axes)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad")];
            tensor<fp32, [1, 1, 256]> squeeze_0 = const()[name = tensor<string, []>("squeeze_0"), val = tensor<fp32, [1, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1408)))];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 21922]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x_strides_1, weight = squeeze_0, x = pad_0)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x")];
            tensor<fp32, [36, 1, 256]> squeeze_1 = const()[name = tensor<string, []>("squeeze_1"), val = tensor<fp32, [36, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2496)))];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_strides_1"), val = tensor<int32, [1]>([256])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx_strides_1, weight = squeeze_1, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_strides_1"), val = tensor<int32, [1]>([256])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [36, 1, 256]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0"), val = tensor<fp32, [36, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39424)))];
            tensor<fp32, [36]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_bias_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_bias_0"), val = tensor<fp32, [36]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76352)))];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg = conv(bias = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_bias_0, dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_1x_strides_1, weight = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg")];
            tensor<fp32, []> const_1 = const()[name = tensor<string, []>("const_1"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_1_pad_0 = const()[name = tensor<string, []>("pad_1_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 22176]> pad_1 = pad(constant_val = const_1, mode = pad_1_mode_0, pad = pad_1_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x)[name = tensor<string, []>("pad_1")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_32 = const()[name = tensor<string, []>("const_32"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 22178]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad_mode_0, pad = const_32, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_2x)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_axis_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp32, [1, 36, 172, 2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack = stack(axis = StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_axis_0, values = (StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1dx, StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg))[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 10961]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x_strides_1, weight = squeeze_0, x = pad_1)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_strides_1"), val = tensor<int32, [1]>([128])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x_strides_1, weight = squeeze_1, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_strides_1"), val = tensor<int32, [1]>([128])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [36]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1_bias_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1_bias_0"), val = tensor<fp32, [36]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76608)))];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1 = conv(bias = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1_bias_0, dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_4x_strides_1, weight = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_1_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1")];
            tensor<fp32, []> const_3 = const()[name = tensor<string, []>("const_3"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_2_pad_0 = const()[name = tensor<string, []>("pad_2_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_2_mode_0 = const()[name = tensor<string, []>("pad_2_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 11215]> pad_2 = pad(constant_val = const_3, mode = pad_2_mode_0, pad = pad_2_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x)[name = tensor<string, []>("pad_2")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_33 = const()[name = tensor<string, []>("const_33"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 11217]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad_mode_0, pad = const_33, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_5x)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_1_axis_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_1_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp32, [1, 36, 172, 2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_1 = stack(axis = StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_1_axis_0, values = (StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_3x, StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_1))[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_1")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 5480]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x_strides_1, weight = squeeze_0, x = pad_2)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_strides_1"), val = tensor<int32, [1]>([64])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x_strides_1, weight = squeeze_1, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_strides_1"), val = tensor<int32, [1]>([64])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [36]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2_bias_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2_bias_0"), val = tensor<fp32, [36]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76864)))];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2 = conv(bias = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2_bias_0, dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_7x_strides_1, weight = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_2_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2")];
            tensor<fp32, []> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_3_pad_0 = const()[name = tensor<string, []>("pad_3_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_3_mode_0 = const()[name = tensor<string, []>("pad_3_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 5734]> pad_3 = pad(constant_val = const_5, mode = pad_3_mode_0, pad = pad_3_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x)[name = tensor<string, []>("pad_3")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_34 = const()[name = tensor<string, []>("const_34"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 5736]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad_mode_0, pad = const_34, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_8x)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_2_axis_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_2_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp32, [1, 36, 172, 2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_2 = stack(axis = StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_2_axis_0, values = (StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_6x, StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_2))[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_2")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 2740]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x_strides_1, weight = squeeze_0, x = pad_3)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_strides_1"), val = tensor<int32, [1]>([32])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x_strides_1, weight = squeeze_1, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_strides_1"), val = tensor<int32, [1]>([32])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [36]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3_bias_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3_bias_0"), val = tensor<fp32, [36]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77120)))];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3 = conv(bias = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3_bias_0, dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_10x_strides_1, weight = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_3_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3")];
            tensor<fp32, []> const_7 = const()[name = tensor<string, []>("const_7"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_4_mode_0 = const()[name = tensor<string, []>("pad_4_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 2994]> pad_4 = pad(constant_val = const_7, mode = pad_4_mode_0, pad = pad_4_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x)[name = tensor<string, []>("pad_4")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_35 = const()[name = tensor<string, []>("const_35"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 2996]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad_mode_0, pad = const_35, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_11x)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_3_axis_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_3_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp32, [1, 36, 172, 2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_3 = stack(axis = StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_3_axis_0, values = (StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_9x, StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_3))[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_3")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 1370]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x_strides_1, weight = squeeze_0, x = pad_4)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_strides_1"), val = tensor<int32, [1]>([16])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x_strides_1, weight = squeeze_1, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_strides_1"), val = tensor<int32, [1]>([16])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [36]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4_bias_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4_bias_0"), val = tensor<fp32, [36]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77376)))];
            tensor<fp32, [1, 36, 172]> StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4 = conv(bias = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4_bias_0, dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_13x_strides_1, weight = StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_weight_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_4_pad)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4")];
            tensor<fp32, []> const_9 = const()[name = tensor<string, []>("const_9"), val = tensor<fp32, []>(0x0p+0)];
            tensor<int32, [6]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [6]>([0, 0, 0, 0, 127, 127])];
            tensor<string, []> pad_5_mode_0 = const()[name = tensor<string, []>("pad_5_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp32, [1, 1, 1624]> pad_5 = pad(constant_val = const_9, mode = pad_5_mode_0, pad = pad_5_pad_0, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x)[name = tensor<string, []>("pad_5")];
            tensor<fp32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_constant_val_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_constant_val_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_mode_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_mode_0"), val = tensor<string, []>("reflect")];
            tensor<int32, [4]> const_36 = const()[name = tensor<string, []>("const_36"), val = tensor<int32, [4]>([0, 0, 128, 128])];
            tensor<fp32, [1, 1, 1626]> StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad = pad(constant_val = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_constant_val_0, mode = StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad_mode_0, pad = const_36, x = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_14x)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_reflection_pad1d_MirrorPad_5_pad")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_4_axis_0 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_4_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp32, [1, 36, 172, 2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_4 = stack(axis = StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_4_axis_0, values = (StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_12x, StatefulPartitionedCall_model_1_cq_t2010v2_1_Neg_4))[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_stack_4")];
            tensor<string, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_type_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_type_1"), val = tensor<string, []>("valid")];
            tensor<int32, []> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_groups_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_groups_1"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_strides_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_strides_1"), val = tensor<int32, [1]>([2])];
            tensor<int32, [2]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_1"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_dilations_1 = const()[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_dilations_1"), val = tensor<int32, [1]>([1])];
            tensor<fp32, [1, 1, 685]> StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x = conv(dilations = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_dilations_1, groups = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_groups_1, pad = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_1, pad_type = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_pad_type_1, strides = StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x_strides_1, weight = squeeze_0, x = pad_5)[name = tensor<string, []>("StatefulPartitionedCall_model_1_cq_t2010v2_1_conv1d_17x")];
